Masmiseim36/nxpSDK/devices/MKM34Z7/drivers/fsl_mmau.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name MMAU Configure
 * @{
 */

/*!
 * @brief Enable DMA for MMAU module.
 *
 * @param base MMAU peripheral address.
 * @param enable Mode of DMA access
 *             - true   Enable DMA access
 *             - false  Disable DMA access
 */
static inline void MMAU_EnableDMA(MMAU_Type *base, bool enable)
{
    if (enable)
    {
        base->CSR |= MMAU_CSR_DRE_MASK;
    }
    else
    {
        base->CSR &= ~(MMAU_CSR_DRE_MASK);
    }
}
/*!
 * @brief Enable supervisor only for MMAU module.
 *
 * @param base MMAU peripheral address.
 * @param enable Mode of MMAU module can be access
 *             - true   MMAU registers can only be access in Supervisor Mode.
 *             - false  MMAU registers can be access in both User Mode or Supervisor Mode.
 */
static inline void MMAU_EnableSupervisorOnly(MMAU_Type *base, bool enable)
{
    if (enable)
    {
        base->CSR |= MMAU_CSR_SO_MASK;
    }
    else
    {
        base->CSR &= ~(MMAU_CSR_SO_MASK);
    }
}

/*!
 * @brief Set control/status register into reset state.
 *
 * This function sets control/status register to a known state. This state is
 * defined in Reference Manual, which is power on reset value. This function must
 * execute in a Supervisor Mode
 * @param base MMAU peripheral address.
 */
void MMAU_Reset(MMAU_Type *base);

/*! @} */

/*!
 * @name MMAU Interrupt
 * @{
 */

/*!
 * @brief Enable MMAU interrupts.
 *
 * This function enables the interrupts related to the mask.
 * Example:
   @code
   MMAU_EnableInterrupts(MMAU, kMMAU_AccumOverflowInterruptEnable | kMMAU_DivideByZeroInterruptEnable);
   @endcode
 *
 * @param base MMAU peripheral address.
 * @param mask Mask of the interrupt enable to be written
 *        (kMMAU_AccumOverflowInterruptEnable|kMMAU_OverflowInterruptEnable|kMMAU_DivideByZeroInterruptEnable).
 */
static inline void MMAU_EnableInterrupts(MMAU_Type *base, uint32_t mask)
{
    base->CSR |= (mask & (kMMAU_AccumOverflowInterruptEnable | kMMAU_OverflowInterruptEnable |
                          kMMAU_DivideByZeroInterruptEnable));
}

/*!
 * @brief Disable MMAU interrupts.
 *
 * This function disables the interrupt related to the mask.
 * Example:
   @code
   MMAU_DisableInterrupts(MMAU, kMMAU_AccumOverflowInterruptEnable | kMMAU_DivideByZeroInterruptEnable);
   @endcode
 *
 * @param base MMAU peripheral address.
 * @param mask Mask of the interrupt enable to be written
 *        (kMMAU_AccumOverflowInterruptEnable|kMMAU_OverflowInterruptEnable|kMMAU_DivideByZeroInterruptEnable).
 */
static inline void MMAU_DisableInterrupts(MMAU_Type *base, uint32_t mask)
{
    base->CSR &= ~(mask & (kMMAU_AccumOverflowInterruptEnable | kMMAU_OverflowInterruptEnable |
                           kMMAU_DivideByZeroInterruptEnable));
}

/*!
 * @brief Gets enabled interrupts.
 *
 * This function gets all interrupt values.
 * Example:
   @code
   uint32_t flags = 0;
   ...
   flags = MMAU_GetEnabledInterrupts(MMAU);
   if (flags & kMMAU_AccumOverflowInterruptEnable)
   {
   ...
   }
   @endcode
 *
 * @param base MMAU peripheral address.
 *
 * @return Combination of enabled interrupt
 */
static inline uint32_t MMAU_GetEnabledInterrupts(MMAU_Type *base)
{
    return base->CSR &
           (kMMAU_AccumOverflowInterruptEnable | kMMAU_OverflowInterruptEnable | kMMAU_DivideByZeroInterruptEnable);
}

/*!
 * @brief Get interrupt flags.
 *
 * This function gets interrupt flags.
 *
 * @param base MMAU peripheral address.
 *
 * @return the mask of these interrupt flag bits.
 */
static inline uint32_t MMAU_GetInterruptFlags(MMAU_Type *base)
{
    return base->CSR &
           (kMMAU_AccumOverflowInterruptFlag | kMMAU_OverflowInterruptFlag | kMMAU_DivideByZeroInterruptFlag);
}

/*!
 * @brief Clears interrupt flags.
 *
 * This function clears the interrupt flags.
 * Example, if you want to clear Overflow and DivideByZero interrupt flags:
   @code
   MMAU_ClearInterruptFlags(MMAU, kMMAU_OverflowInterruptFlag|kMMAU_DivideByZeroInterruptFlag);
   @endcode
 *
 * @param base MMAU peripheral address.
 * @param mask Mask of the asserted interrupt flags
 *          (kMMAU_AccumOverflowInterruptFlag|kMMAU_OverflowInterruptFlag|kMMAU_DivideByZeroInterruptFlag).
 */
void MMAU_ClearInterruptFlags(MMAU_Type *base, uint32_t mask);

/*! @} */

/*!
 * @name MMAU Instruction flag
 * @{
 */

/*!
 * @brief Gets the instruction flags.
 *
 * This function gets the instruction flag. Instruction flags are
 * updated by the MMAU after computation of each instruction.
 * Example:
   @code
   uint32_t flags;
   ...
   flags = MMAU_GetInstructionFlags(MMAU);
   if (flags & kMMAU_OverflowInstructionFlag)
   {
    ...
   }
   @endcode
 *
 * @param base MMAU peripheral address.
 *
 * @return Combination of all instruction flags.
 */
static inline uint32_t MMAU_GetInstructionFlags(MMAU_Type *base)
{
    return base->CSR & (kMMAU_AccumOverflowInstructionFlag | kMMAU_OverflowInstructionFlag |
                        kMMAU_DivideByZeroInstructionFlag | kMMAU_NegativeInstructionFlag);
}

/*!
 * @brief Sets the instruction flags.
 *
 * This function sets the instruction flags.
 * Example:
   @code
   MMAU_SetInstructionFlags(MMAU, kMMAU_AccumOverflowInstructionFlag | kMMAU_NegativeInstructionFlag);
   MMAU_SetInstructionFlags(MMAU, kMMAU_OverflowInstructionFlag | kMMAU_DivideByZeroInstructionFlag);
   @endcode
 *
 * @param base MMAU peripheral address.
 * @param mask Mask of the instruction flags to be written
 *
 (kMMAU_AccumOverflowInstructionFlag|kMMAU_OverflowInstructionFlag|kMMAU_DivideByZeroInstructionFlag|kMMAU_NegativeInstructionFlag).
 */
void MMAU_SetInstructionFlags(MMAU_Type *base, uint32_t mask);

/*!
 * @brief Clears instruction flags.
 *
 * This function clears the instruction flags.
 * Example, if you want to clear Overflow and DivideByZero instruction flags:
   @code
   MMAU_ClearInstructionFlags(MMAU, kMMAU_OverflowInstructionFlag|kMMAU_DivideByZeroInstructionFlag);
   @endcode
 *
 * @param base MMAU peripheral address.
 * @param mask Mask of the asserted instruction flags
 *
 (kMMAU_AccumOverflowInstructionFlag|kMMAU_OverflowInstructionFlag|kMMAU_DivideByZeroInstructionFlag|kMMAU_NegativeInstructionFlag).
 */
void MMAU_ClearInstructionFlags(MMAU_Type *base, uint32_t mask);

/*! @} */

/*!
 * @brief Gets hardware revision level.
 *
 * This function gets the hardware revision level of the MMAU. It returns HDR field
 * of the control/status register.
 *
 * @param base MMAU peripheral address.
 * @return uint32_t hardware revision level.
 */
static inline uint32_t MMAU_GetHwRevCmd(MMAU_Type *base)
{
    return ((base->CSR & MMAU_CSR_HDR_MASK) >> MMAU_CSR_HDR_SHIFT);
}

/*!
 * @name Unsigned Integer Operands
 * @{
 */

/*!
 * @brief   Load A10 accumulator register of the MMAU by 64-bit unsigned value.
 *
 * The ulda_d function loads A10 accumulator register of the MMAU
 * by 64-bit unsigned value.
 *
 * @param   dval    uint64_t unsigned load value.
 */
static inline void MMAU_ulda_d(register uint64_t dval)
{
    *((uint64_t volatile *)(MMAU__REGRW | MMAU__A10)) = dval;
}
/*!
 * @brief   Multiply two 32-bit unsigned values returning a 64-bit unsigned
 *          product.
 *
 * The @ref MMAU_d_umul_ll function multiplies two 32-bit unsigned values
 * returning a 64-bit unsigned product.
 * @param   lval1   uint32_t unsigned value.
 * @param   lval2   uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umul_ll(register uint32_t lval1, register uint32_t lval2)
{
    *((uint32_t volatile *)(MMAU__UMUL | MMAU__X2)) = lval1;
    *((uint32_t volatile *)(MMAU__UMUL | MMAU__X3)) = lval2;
    return *((uint64_t volatile *)(MMAU__UMUL | MMAU__A10));
}

/*!
 * @brief   Multiply 64-bit unsigned value with 32-bit unsigned value returning
 *          a 64-bit unsigned product.
 *
 * The @ref MMAU_d_umul_dl function multiplies 64-bit unsigned value with
 * 32-bit unsigned value returning a 64-bit unsigned product.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umul_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMULD | MMAU__X1)) = dval;
    *((uint32_t volatile *)(MMAU__UMULD | MMAU__X3)) = lval;
    return *((uint64_t volatile *)(MMAU__UMULD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit unsigned value with 32-bit unsigned value
 *          returning saturated 64-bit unsigned product.
 *
 * The @ref MMAU_d_umuls_dl function multiplies 64-bit unsigned value with
 * 32-bit unsigned value returning saturated 64-bit unsigned product.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline uint64_t MMAU_d_umuls_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMULD | MMAU__X1 | MMAU__SAT)) = dval;
    *((uint32_t volatile *)(MMAU__UMULD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((uint64_t volatile *)(MMAU__UMULD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit unsigned value with 64-bit unsigned value stored in
 *          the A10 register of the MMAU returning a 64-bit unsigned product.
 *
 * The @ref MMAU_d_umula_l function multiplies 32-bit unsigned value with
 * 64-bit unsigned value stored in the A10 register of the MMAU
 * returning a 64-bit unsigned product.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umula_l(register uint32_t lval)
{
    *((uint32_t volatile *)(MMAU__UMULDA | MMAU__X3)) = lval;
    return *((uint64_t volatile *)(MMAU__UMULDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit unsigned value with 64-bit unsigned value
 *          stored in the A10 register of the MMAU returning saturated 64-bit unsigned
 *          product.
 *
 * The @ref MMAU_d_umulas_l function multiplies 32-bit unsigned value with
 * 64-bit unsigned value stored in the A10 register of the MMAU
 * returning saturated 64-bit unsigned product.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value  after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline uint64_t MMAU_d_umulas_l(register uint32_t lval)
{
    *((uint32_t volatile *)(MMAU__UMULDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((uint64_t volatile *)(MMAU__UMULDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply two 32-bit unsigned values and add product with value
 *          stored in the A10 register of the MMAU returning a 64-bit unsigned
 *          A10 register value.
 *
 * The @ref MMAU_d_umac_ll function multiplies two 32-bit unsigned values
 * and add product with value stored in the A10 register of the MMAU
 * returning a 64-bit unsigned A10 register value.
 * @param   lval1   uint32_t unsigned value.
 * @param   lval2   uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umac_ll(register uint32_t lval1, register uint32_t lval2)
{
    *((uint32_t volatile *)(MMAU__UMAC | MMAU__X2)) = lval1;
    *((uint32_t volatile *)(MMAU__UMAC | MMAU__X3)) = lval2;
    return *((uint64_t volatile *)(MMAU__UMAC | MMAU__A10));
}

/*!
 * @brief   Saturating multiply two 32-bit unsigned values and add product with
 *          value stored in the A10 register of the MMAU returning a 64-bit unsigned
 *          A10 register value.
 *
 * The @ref MMAU_d_umacs_ll function multiplies two 32-bit unsigned values
 * and add product with value stored in the A10 register of the MMAU
 * returning saturated 64-bit unsigned A10 register value.
 * @param   lval1   uint32_t unsigned value.
 * @param   lval2   uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline uint64_t MMAU_d_umacs_ll(register uint32_t lval1, register uint32_t lval2)
{
    *((uint32_t volatile *)(MMAU__UMAC | MMAU__X2 | MMAU__SAT)) = lval1;
    *((uint32_t volatile *)(MMAU__UMAC | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((uint64_t volatile *)(MMAU__UMAC | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit unsigned value with 32-bit unsigned value and add
 *          product with value stored in the A10 register of the MMAU
 *          returning a 64-bit unsigned A10 register value.
 *
 * @details The @ref MMAU_d_umac_dl function multiplies 64-bit unsigned value with
 *          32-bit unsigned value and add product with value stored in the
 *          A10 register of the MMAU returning a 64-bit unsigned A10 register
 *          value.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umac_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMACD | MMAU__X1)) = dval;
    *((uint32_t volatile *)(MMAU__UMACD | MMAU__X3)) = lval;
    return *((uint64_t volatile *)(MMAU__UMACD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit unsigned value with 32-bit unsigned value
 *          and add product with value stored in the A10 register of the MMAU
 *          returning saturated 64-bit unsigned A10 register value.
 *
 * @details The @ref MMAU_d_umacs_dl function multiplies 64-bit unsigned value with
 *          32-bit unsigned value and add product with value stored in the
 *          A10 register of the MMAU returning saturated 64-bit unsigned A10
 *          register value.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline uint64_t MMAU_d_umacs_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMACD | MMAU__X1 | MMAU__SAT)) = dval;
    *((uint32_t volatile *)(MMAU__UMACD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((uint64_t volatile *)(MMAU__UMACD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit unsigned value by value stored in the A10 register
 *          of the MMAU and add product with 64-bit unsigned value returning
 *          a 64-bit unsigned A10 register value.
 *
 * @details The @ref MMAU_d_umaca_dl function multiplies 32-bit unsigned value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit unsigned value returning a 64-bit unsigned A10 register
 *          value.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_umaca_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMACDA | MMAU__X1)) = dval;
    *((uint32_t volatile *)(MMAU__UMACDA | MMAU__X3)) = lval;
    return *((uint64_t volatile *)(MMAU__UMACDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit unsigned value by value stored in the A10
 *          register of the MMAU and add product with 64-bit unsigned value returning
 *          a saturated 64-bit unsigned A10 register value.
 *
 * @details The @ref MMAU_d_umacas_dl function multiplies 32-bit unsigned value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit unsigned value returning saturated 64-bit unsigned A10
 *          register value.
 * @param   dval    uint64_t unsigned value.
 * @param   lval    uint32_t unsigned value.
 * @return  uint64_t unsigned value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline uint64_t MMAU_d_umacas_dl(register uint64_t dval, register uint32_t lval)
{
    *((uint64_t volatile *)(MMAU__UMACDA | MMAU__X1 | MMAU__SAT)) = dval;
    *((uint32_t volatile *)(MMAU__UMACDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((uint64_t volatile *)(MMAU__UMACDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide two 32-bit unsigned values returning a 32-bit unsigned
 *          quotient.
 *
 * @details The @ref MMAU_l_udiv_ll function divides two 32-bit unsigned values
 *          returning a 32-bit unsigned quotient.
 * @param   lnum    uint32_t unsigned divisor value.
 * @param   lden    uint32_t unsigned dividend value.
 * @return  uint32_t unsigned quotient value.
 * @note    Quotient is stored in A0 register of the MMAU for next computation.
 */
static inline uint32_t MMAU_l_udiv_ll(register uint32_t lnum, register uint32_t lden)
{
    *((uint32_t volatile *)(MMAU__UDIV | MMAU__X2)) = lnum;
    *((uint32_t volatile *)(MMAU__UDIV | MMAU__X3)) = lden;
    return *((uint32_t volatile *)(MMAU__UDIV | MMAU__A0));
}

/*!
 * @brief   Divide 64-bit unsigned value by 32-bit unsigned value returning a
 *          64-bit unsigned quotient.
 *
 * @details The @ref MMAU_d_udiv_dl function divides 64-bit unsigned value by 32-bit
 *          unsigned value returning a 64-bit unsigned quotient.
 * @param   dnum    uint64_t unsigned divisor value.
 * @param   lden    uint32_t unsigned dividend value.
 * @return  uint64_t unsigned quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_udiv_dl(register uint64_t dnum, register uint32_t lden)
{
    *((uint64_t volatile *)(MMAU__UDIVD | MMAU__X1)) = dnum;
    *((uint32_t volatile *)(MMAU__UDIVD | MMAU__X3)) = lden;
    return *((uint64_t volatile *)(MMAU__UDIVD | MMAU__A10));
}

/*!
 * @brief   Divide two 64-bit unsigned values returning a 64-bit unsigned
 *          quotient.
 *
 * @details The @ref MMAU_d_udiv_dd function divides two 64-bit unsigned values
 *          returning a 64-bit unsigned quotient.
 * @param   dnum    uint64_t unsigned divisor value.
 * @param   dden    uint64_t unsigned dividend value.
 * @return  uint64_t unsigned quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_udiv_dd(register uint64_t dnum, register uint64_t dden)
{
    *((uint64_t volatile *)(MMAU__UDIVDD | MMAU__X0)) = dnum;
    *((uint64_t volatile *)(MMAU__UDIVDD | MMAU__X2)) = dden;
    return *((uint64_t volatile *)(MMAU__UDIVDD | MMAU__A10));
}

/*!
 * @brief   Divide 32-bit unsigned value stored in the A10 register of the MMAU
 *          by 32-bit unsigned value returning a 64-bit unsigned quotient.
 *
 * @details The @ref MMAU_d_udiva_l function divides 64-bit unsigned value stored in
 *          the A10 register of the MMAU by 32-bit unsigned value returning
 *          a 64-bit unsigned quotient.
 * @param   lden1   uint32_t unsigned dividend value.
 * @return  uint64_t unsigned quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_udiva_l(register uint32_t lden1)
{
    *((uint32_t volatile *)(MMAU__UDIVDA | MMAU__X3)) = lden1;
    return *((uint64_t volatile *)(MMAU__UDIVDA | MMAU__A10));
}

/*!
 * @brief   Divide 64-bit unsigned value stored in the A10 register of the MMAU
 *          by 64-bit unsigned value returning a 64-bit unsigned quotient.
 *
 * @details The @ref MMAU_d_udiva_d function divides 64-bit unsigned value stored in
 *          the A10 register of the MMAU by 64-bit unsigned value returning
 *          a 64-bit unsigned quotient.
 * @param   dden1   uint64_t unsigned dividend value.
 * @return  uint64_t unsigned quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline uint64_t MMAU_d_udiva_d(register uint64_t dden1)
{
    *((uint64_t volatile *)(MMAU__UDIVDDA | MMAU__X2)) = dden1;
    return *((uint64_t volatile *)(MMAU__UDIVDDA | MMAU__A10));
}

/*!
 * @brief   Compute and return a 32-bit unsigned square root of the 32-bit
 *          unsigned radicand.
 *
 * @details The @ref MMAU_l_usqr_l function computes and returns a 32-bit unsigned
 *          square root of the 32-bit unsigned radicand.
 * @param   lrad    uint32_t unsigned radicand.
 * @return  uint32_t unsigned square root.
 * @note    Quotient is stored in A0 register of the MMAU for next computation.
 */
static inline uint32_t MMAU_l_usqr_l(register uint32_t lrad)
{
    *((uint32_t volatile *)(MMAU__USQR | MMAU__X3)) = lrad;
    return *((uint32_t volatile *)(MMAU__USQR | MMAU__A0));
}

/*!
 * @brief   Compute and return a 32-bit unsigned square root of the 64-bit
 *          unsigned radicand.
 *
 * @details The @ref MMAU_l_usqr_d function computes and returns a 32-bit unsigned
 *          square root of the 64-bit unsigned radicand.
 * @param   drad    uint64_t unsigned radicand.
 * @return  uint32_t unsigned square root.
 * @note    Quotient is stored in A0 register of the MMAU for next computation.
 */
static inline uint32_t MMAU_l_usqr_d(register uint64_t drad)
{
    *((uint64_t volatile *)(MMAU__USQRD | MMAU__X2)) = drad;
    return *((uint32_t volatile *)(MMAU__USQRD | MMAU__A0));
}

/*!
 * @brief   Compute and return a 16-bit unsigned square root of the 32-bit
 *          unsigned radicand.
 *
 * @details The @ref MMAU_s_usqr_l function computes and returns a 16-bit unsigned
 *          square root of the 32-bit unsigned radicand.
 * @param   lrad    uint32 unsigned radicand.
 * @return  uint16 unsigned square root.
 * @note    Square root is stored in A0 register of the MMAU for next
 *          computation.
 */
static inline uint16_t MMAU_s_usqr_l(register uint32_t lrad)
{
    *((uint32_t volatile *)(MMAU__USQR | MMAU__X3)) = lrad;
    return (uint16_t)(*((uint32_t volatile *)(MMAU__USQR | MMAU__A0)));
}

/*!
 * @brief   Compute and return a 32-bit unsigned square root of the radicand
 *          stored in the A10 register of the MMAU.
 *
 * @details The @ref MMAU_l_usqra function computes and returns a 32-bit unsigned
 *          square root of the radicand stored in the A10 register of the MMAU.
 * @return  uint32_t unsigned square root.
 * @note    Quotient is stored in A0 register of the MMAU for next computation.
 */
static inline uint32_t MMAU_l_usqra(void)
{
    return *((uint32_t volatile *)(MMAU__USQRDA | MMAU__A0));
}
/*! @} */

/*!
 * @name Signed Integer Operands
 * @{
 */

