Masmiseim36/nxpSDK/devices/MKM34Z7/drivers/fsl_mmau.h
/*!
 * @brief   Load A10 accumulator register of the MMAU by 64-bit integer value.
 *
 * @details The @ref MMAU_slda_d function loads A10 accumulator register of the MMAU
 *          by 64-bit integer value.
 * @param   dval    int64_t integer value.
 */
static inline void MMAU_slda_d(register int64_t dval)
{
    *((int64_t volatile *)(MMAU__REGRW | MMAU__A10)) = dval;
}
/*!
 * @brief   Multiply two 32-bit integer values returning a 64-bit integer
 *          product.
 *
 * @details The @ref MMAU_d_smul_ll function multiplies two 32-bit integer values
 *          returning a 64-bit integer product.
 * @param   lval1   int32_t integer value.
 * @param   lval2   int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smul_ll(register int32_t lval1, register int32_t lval2)
{
    *((int32_t volatile *)(MMAU__SMUL | MMAU__X2)) = lval1;
    *((int32_t volatile *)(MMAU__SMUL | MMAU__X3)) = lval2;
    return *((int64_t volatile *)(MMAU__SMUL | MMAU__A10));
}

/*!
 * @brief   Multiply 64-bit integer value with 32-bit integer value returning a
 *          64-bit integer product.
 *
 * @details The @ref MMAU_d_smul_dl function multiplies 64-bit integer value with
 *          32-bit integer value returning a 64-bit integer product.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smul_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMULD | MMAU__X1)) = dval;
    *((int32_t volatile *)(MMAU__SMULD | MMAU__X3)) = lval;
    return *((int64_t volatile *)(MMAU__SMULD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit integer value with 32-bit integer value
 *          returning saturated 64-bit integer product.
 *
 * @details The @ref MMAU_d_smuls_dl function multiplies 64-bit integer value with
 *          32-bit integer value returning saturated 64-bit integer product.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline int64_t MMAU_d_smuls_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMULD | MMAU__X1 | MMAU__SAT)) = dval;
    *((int32_t volatile *)(MMAU__SMULD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((int64_t volatile *)(MMAU__SMULD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit integer value with 64-bit integer value stored in
 *          the A10 register of the MMAU returning a 64-bit integer product.
 *
 * @details The @ref MMAU_d_smula_l function multiplies 32-bit integer value with
 *          64-bit integer value stored in the A10 register of the MMAU
 *          returning a 64-bit integer product.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smula_l(register int32_t lval)
{
    *((int32_t volatile *)(MMAU__SMULDA | MMAU__X3)) = lval;
    return *((int64_t volatile *)(MMAU__SMULDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit integer value with 64-bit integer value
 *          stored in the A10 register of the MMAU returning saturated 64-bit integer
 *          product.
 *
 * @details The @ref MMAU_d_smulas_l function multiplies 32-bit integer value with
 *          64-bit integer value stored in the A10 register of the MMAU
 *          returning saturated 64-bit integer product.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline int64_t MMAU_d_smulas_l(register int32_t lval)
{
    *((int32_t volatile *)(MMAU__SMULDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((int64_t volatile *)(MMAU__SMULDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply two 32-bit integer values and add product with value stored
 *          in the A10 register of the MMAU returning a 64-bit integer
 *          A10 register value.
 *
 * @details The @ref MMAU_d_smac_ll function multiplies two 32-bit integer values and
 *          add product with value stored in the A10 register of the MMAU
 *          returning a 64-bit integer A10 register value.
 * @param   lval1   int32_t integer value.
 * @param   lval2   int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smac_ll(register int32_t lval1, register int32_t lval2)
{
    *((int32_t volatile *)(MMAU__SMAC | MMAU__X2)) = lval1;
    *((int32_t volatile *)(MMAU__SMAC | MMAU__X3)) = lval2;
    return *((int64_t volatile *)(MMAU__SMAC | MMAU__A10));
}

/*!
 * @brief   Saturating multiply two 32-bit integer values and add product with
 *          value stored in the A10 register of the MMAU returning a 64-bit integer
 *          A10 register value.
 *
 * @details The @ref MMAU_d_smacs_ll function multiplies two 32-bit integer values
 *          and add product with value stored in the A10 register of the MMAU
 *          returning saturated 64-bit integer A10 register value.
 * @param   lval1   int32_t integer value.
 * @param   lval2   int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline int64_t MMAU_d_smacs_ll(register int32_t lval1, register int32_t lval2)
{
    *((int32_t volatile *)(MMAU__SMAC | MMAU__X2 | MMAU__SAT)) = lval1;
    *((int32_t volatile *)(MMAU__SMAC | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((int64_t volatile *)(MMAU__SMAC | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit integer value with 32-bit integer value and add
 *          product with value stored in the A10 register of the MMAU
 *          returning a 64-bit integer A10 register value.
 *
 * @details The @ref MMAU_d_smac_dl function multiplies 64-bit integer value with
 *          32-bit integer value and add product with value stored in the
 *          A10 register of the MMAU returning a 64-bit integer A10 register
 *          value.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smac_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMACD | MMAU__X1)) = dval;
    *((int32_t volatile *)(MMAU__SMACD | MMAU__X3)) = lval;
    return *((int64_t volatile *)(MMAU__SMACD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit integer value with 32-bit integer value
 *          and add product with value stored in the A10 register of the MMAU
 *          returning saturated 64-bit integer A10 register value.
 *
 * @details The @ref MMAU_d_smacs_dl function multiplies 64-bit integer value with
 *          32-bit integer value and add product with value stored in the
 *          A10 register of the MMAU returning saturated 64-bit integer A10
 *          register value.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline int64_t MMAU_d_smacs_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMACD | MMAU__X1 | MMAU__SAT)) = dval;
    *((int32_t volatile *)(MMAU__SMACD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((int64_t volatile *)(MMAU__SMACD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit integer value by value stored in the A10 register of
 *          the MMAU and add product with 64-bit integer value returning
 *          a 64-bit integer A10 register value.
 *
 * @details The @ref MMAU_d_smaca_dl function multiplies 32-bit integer value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit integer value returning a 64-bit integer A10 register value.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_smaca_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMACDA | MMAU__X1)) = dval;
    *((int32_t volatile *)(MMAU__SMACDA | MMAU__X3)) = lval;
    return *((int64_t volatile *)(MMAU__SMACDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit integer value by value stored in the A10
 *          register of the MMAU and add product with 64-bit integer value returning
 *          a saturated 64-bit integer A10 register value.
 *
 * @details The @ref MMAU_d_smacas_dl function multiplies 32-bit integer value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit integer value returning saturated 64-bit integer A10 register
 *          value.
 * @param   dval    int64_t integer value.
 * @param   lval    int32_t integer value.
 * @return  int64_t integer value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline int64_t MMAU_d_smacas_dl(register int64_t dval, register int32_t lval)
{
    *((int64_t volatile *)(MMAU__SMACDA | MMAU__X1 | MMAU__SAT)) = dval;
    *((int32_t volatile *)(MMAU__SMACDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((int64_t volatile *)(MMAU__SMACDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide two 32-bit integer values returning a 32-bit integer
 *          quotient.
 *
 * @details The @ref MMAU_l_sdiv_ll function divides two 32-bit integer values
 *          returning a 32-bit integer quotient.
 * @param   lnum    int32_t integer divisor value.
 * @param   lden    int32_t integer dividend value.
 * @return  int32_t integer quotient value.
 * @note    Quotient is stored in A0 register of the MMAU for next computation.
 */
static inline int32_t MMAU_l_sdiv_ll(register int32_t lnum, register int32_t lden)
{
    *((int32_t volatile *)(MMAU__SDIV | MMAU__X2)) = lnum;
    *((int32_t volatile *)(MMAU__SDIV | MMAU__X3)) = lden;
    return *((int32_t volatile *)(MMAU__SDIV | MMAU__A0));
}

/*!
 * @brief   Divide two 32-bit integer values returning a 32-bit integer
 *          quotient.
 *
 * @details The @ref MMAU_l_sdivs_ll function divides two 32-bit integer values
 *          returning a 32-bit integer quotient.
 * @param   lnum    int32_t integer divisor value.
 * @param   lden    int32_t integer dividend value.
 * @return  int32_t integer quotient value.
 * @note    Saturated quotient is  stored in A0 register of the MMAU for
 *          next computation.
 */
static inline int32_t MMAU_l_sdivs_ll(register int32_t lnum, register int32_t lden)
{
    *((int32_t volatile *)(MMAU__SDIV | MMAU__X2 | MMAU__SAT)) = lnum;
    *((int32_t volatile *)(MMAU__SDIV | MMAU__X3 | MMAU__SAT)) = lden;
    return *((int32_t volatile *)(MMAU__SDIV | MMAU__A0 | MMAU__SAT));
}

/*!
 * @brief   Divide 64-bit integer value by 32-bit integer value returning a
 *          64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdiv_dl function divides 64-bit integer value by 32-bit
 *          integer value returning a 64-bit integer quotient.
 * @param   dnum    int64_t integer divisor value.
 * @param   lden    int32_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_sdiv_dl(register int64_t dnum, register int32_t lden)
{
    *((int64_t volatile *)(MMAU__SDIVD | MMAU__X1)) = dnum;
    *((int32_t volatile *)(MMAU__SDIVD | MMAU__X3)) = lden;
    return *((int64_t volatile *)(MMAU__SDIVD | MMAU__A10));
}

/*!
 * @brief   Divide 64-bit integer value by 32-bit integer value returning a
 *          64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdivs_dl function divides 64-bit integer value by 32-bit
 *          integer value returning a 64-bit integer quotient.
 * @param   dnum    int64_t integer divisor value.
 * @param   lden    int32_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation.
 */
static inline int64_t MMAU_d_sdivs_dl(register int64_t dnum, register int32_t lden)
{
    *((int64_t volatile *)(MMAU__SDIVD | MMAU__X1 | MMAU__SAT)) = dnum;
    *((int32_t volatile *)(MMAU__SDIVD | MMAU__X3 | MMAU__SAT)) = lden;
    return *((int64_t volatile *)(MMAU__SDIVD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide two 64-bit integer values returning a 64-bit integer
 *          quotient.
 *
 * @details The @ref MMAU_d_sdiv_dd function divides two 64-bit integer values
 *          returning a 64-bit integer quotient.
 * @param   dnum    int64_t integer divisor value.
 * @param   dden    int64_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_sdiv_dd(register int64_t dnum, register int64_t dden)
{
    *((int64_t volatile *)(MMAU__SDIVDD | MMAU__X0)) = dnum;
    *((int64_t volatile *)(MMAU__SDIVDD | MMAU__X2)) = dden;
    return *((int64_t volatile *)(MMAU__SDIVDD | MMAU__A10));
}

/*!
 * @brief   Divide two 64-bit integer values returning a 64-bit integer
 *          quotient.
 *
 * @details The @ref MMAU_d_sdivs_dd function divides two 64-bit integer values
 *          returning a 64-bit integer quotient.
 * @param   dnum    int64_t integer divisor value.
 * @param   dden    int64_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation.
 */
static inline int64_t MMAU_d_sdivs_dd(register int64_t dnum, register int64_t dden)
{
    *((int64_t volatile *)(MMAU__SDIVDD | MMAU__X0 | MMAU__SAT)) = dnum;
    *((int64_t volatile *)(MMAU__SDIVDD | MMAU__X2 | MMAU__SAT)) = dden;
    return *((int64_t volatile *)(MMAU__SDIVDD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide 32-bit integer value stored in the A10 register of the MMAU
 *          by 32-bit integer value returning a 64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdiva_l function divides 32-bit integer value stored in
 *          the A10 register of the MMAU by 32-bit integer value returning
 *          a 64-bit integer quotient.
 * @param   lden1   int32_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_sdiva_l(register int32_t lden1)
{
    *((int32_t volatile *)(MMAU__SDIVDA | MMAU__X3)) = lden1;
    return *((int64_t volatile *)(MMAU__SDIVDA | MMAU__A10));
}

/*!
 * @brief   Divide 32-bit integer value stored in the A10 register of the MMAU
 *          by 32-bit integer value returning saturated 64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdivas_l function divides 32-bit integer value stored in
 *          the A10 register of the MMAU by 32-bit integer value returning
 *          a saturated 64-bit integer quotient.
 * @param   lden1   int32_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation.
 */
static inline int64_t MMAU_d_sdivas_l(register int32_t lden1)
{
    *((int32_t volatile *)(MMAU__SDIVDA | MMAU__X3 | MMAU__SAT)) = lden1;
    return *((int64_t volatile *)(MMAU__SDIVDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide 64-bit integer value stored in the A10 register of the MMAU
 *          by 64-bit integer value returning a 64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdiva_d function divides 64-bit integer value stored in
 *          the A10 register of the MMAU by 64-bit integer value returning
 *          a 64-bit integer quotient.
 * @param   dden1   int64_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline int64_t MMAU_d_sdiva_d(register int64_t dden1)
{
    *((int64_t volatile *)(MMAU__SDIVDDA | MMAU__X2)) = dden1;
    return *((int64_t volatile *)(MMAU__SDIVDDA | MMAU__A10));
}

/*!
 * @brief   Divide 64-bit integer value stored in the A10 register of the MMAU
 *          by 64-bit integer value returning saturated 64-bit integer quotient.
 *
 * @details The @ref MMAU_d_sdivas_d function divides 64-bit integer value stored in
 *          the A10 register of the MMAU by 64-bit integer value returning
 *          a saturated 64-bit integer quotient.
 * @param   dden1   int64_t integer dividend value.
 * @return  int64_t integer quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation.
 */
static inline int64_t MMAU_d_sdivas_d(register int64_t dden1)
{
    *((int64_t volatile *)(MMAU__SDIVDDA | MMAU__X2 | MMAU__SAT)) = dden1;
    return *((int64_t volatile *)(MMAU__SDIVDDA | MMAU__A10 | MMAU__SAT));
}

/*! @} */

/*!
 * @name Fractional Operands
 * @{
 */

/*!
 * @brief   Load A10 accumulator register of the MMAU by 64-bit fractional
 *          value.
 *
 * @details The @ref MMAU_lda_d function loads A10 accumulator register of the MMAU
 *          by 64-bit fractional value.
 * @param   dval    @ref frac64_t fractional value.
 */
static inline void MMAU_lda_d(register frac64_t dval)
{
    *((frac64_t volatile *)(MMAU__REGRW | MMAU__A10)) = dval;
}
/*!
 * @brief   Multiply two 32-bit fractional values returning a 32-bit fractional
 *          product.
 *
 * @details The @ref MMAU_l_mul_ll function multiplies two 32-bit fractional values
 *          returning a 32-bit fractional product.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_mul_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X2)) = lval1;
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X3)) = lval2;
    return *((frac32_t volatile *)(MMAU__QMUL | MMAU__A1));
}

/*!
 * @brief   Saturating multiply two 32-bit fractional values returning saturated
 *          32-bit fractional product.
 *
 * @details The @ref MMAU_l_muls_ll function multiplies two 32-bit fractional values
 *          returning saturated 32-bit fractional product.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_muls_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X2 | MMAU__SAT)) = lval1;
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((frac32_t volatile *)(MMAU__QMUL | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Multiply two 32-bit fractional values returning a 64-bit fractional
 *          product.
 *
 * @details The @ref MMAU_d_mul_ll function multiplies two 32-bit fractional values
 *          returning a 64-bit fractional product.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_mul_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X2)) = lval1;
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X3)) = lval2;
    return *((frac64_t volatile *)(MMAU__QMUL | MMAU__A10));
}

/*!
 * @brief   Saturating multiply two 32-bit fractional values returning saturated
 *          64-bit fractional product.
 *
 * @details The @ref MMAU_d_muls_ll function multiplies two 32-bit fractional values
 *          returning saturated 64-bit fractional product.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_muls_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X2 | MMAU__SAT)) = lval1;
    *((frac32_t volatile *)(MMAU__QMUL | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((frac64_t volatile *)(MMAU__QMUL | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit fractional value with 32-bit fractional value
 *          returning a 64-bit fractional product.
 *
 * @details The @ref MMAU_d_mul_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value returning a 64-bit fractional product.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_mul_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMULD | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMULD | MMAU__X3)) = lval;
    return *((frac64_t volatile *)(MMAU__QMULD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit fractional value with 32-bit fractional
 *          value returning saturated 64-bit fractional product.
 *
 * @details The @ref MMAU_d_muls_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value returning saturated 64-bit fractional product.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_muls_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMULD | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMULD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac64_t volatile *)(MMAU__QMULD | MMAU__A10 | MMAU__SAT));
}

