Masmiseim36/nxpSDK/devices/MKM34Z7/drivers/fsl_mmau.h
/*!
 * @brief   Multiply 32-bit fractional value with 64-bit fractional value stored
 *          in the A10 register of the MMAU returning a 64-bit fractional product.
 *
 * @details The @ref MMAU_d_mula_l function multiplies 32-bit fractional value with
 *          64-bit fractional value stored in the A10 register of the MMAU
 *          returning a 64-bit fractional product.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_mula_l(register frac32_t lval)
{
    *((frac32_t volatile *)(MMAU__QMULDA | MMAU__X3)) = lval;
    return *((frac64_t volatile *)(MMAU__QMULDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit fractional value with 64-bit fractional
 *          value stored in the A10 register of the MMAU returning saturated 64-bit
 *          fractional product.
 *
 * @details The @ref MMAU_d_mulas_l function multiplies 32-bit fractional value with
 *          64-bit fractional value stored in the A10 register of the MMAU
 *          returning saturated 64-bit fractional product.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_mulas_l(register frac32_t lval)
{
    *((frac32_t volatile *)(MMAU__QMULDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac64_t volatile *)(MMAU__QMULDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit fractional value with 32-bit fractional value
 *          returning a 32-bit fractional product.
 *
 * @details The @ref MMAU_l_mul_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value returning a 32-bit fractional product.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_mul_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMULD | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMULD | MMAU__X3)) = lval;
    return *((frac32_t volatile *)(MMAU__QMULD | MMAU__A1));
}

/*!
 * @brief   Saturating multiply 64-bit fractional value with 32-bit fractional
 *          value returning saturated 32-bit fractional product.
 *
 * @details The @ref MMAU_l_muls_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value returning saturated 32-bit fractional
 *          product.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_muls_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMULD | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMULD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac32_t volatile *)(MMAU__QMULD | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit fractional value with 64-bit fractional value stored
 *          in the A10 register of the MMAU returning a 32-bit fractional
 *          product.
 *
 * @details The @ref MMAU_l_mula_l function multiplies 32-bit fractional value with
 *          64-bit fractional value stored in the A10 register of the MMAU
 *          returning a 32-bit fractional product.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_mula_l(register frac32_t lval)
{
    *((frac32_t volatile *)(MMAU__QMULDA | MMAU__X3)) = lval;
    return *((frac32_t volatile *)(MMAU__QMULDA | MMAU__A1));
}

/*!
 * @brief   Saturating multiply 32-bit fractional value with 64-bit fractional
 *          value stored in the A10 register of the MMAU returning saturated
 *          32-bit fractional product.
 *
 * @details The @ref MMAU_l_mulas_l function multiplies 32-bit fractional value with
 *          64-bit fractional value stored in the A10 register of the MMAU
 *          returning saturated 32-bit fractional product.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_mulas_l(register frac32_t lval)
{
    *((frac32_t volatile *)(MMAU__QMULDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac32_t volatile *)(MMAU__QMULDA | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Multiply two 32-bit fractional values and add product with value
 *          stored in the A10 register of the MMAU returning a 64-bit fractional
 *          A10 register value.
 *
 * @details The @ref MMAU_d_mac_ll function multiplies two 32-bit fractional values
 *          and add product with value stored in the A10 register of the MMAU
 *          returning a 64-bit fractional A10 register value.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_mac_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X2)) = lval1;
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X3)) = lval2;
    return *((frac64_t volatile *)(MMAU__QMAC | MMAU__A10));
}

/*!
 * @brief   Saturating multiply two 32-bit fractional values and add product
 *          with value stored in the A10 register of the MMAU returning a 64-bit fractional
 *          A10 register value.
 *
 * @details The @ref MMAU_d_macs_ll function multiplies two 32-bit fractional values
 *          and add product with value stored in the A10 register of the MMAU
 *          returning saturated 64-bit fractional A10 register value.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_macs_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X2 | MMAU__SAT)) = lval1;
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((frac64_t volatile *)(MMAU__QMAC | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit fractional value with 32-bit fractional value and
 *          add product with value stored in the A10 register of the MMAU
 *          returning a 64-bit fractional A10 register value.
 *
 * @details The @ref MMAU_d_mac_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value and add product with value stored in the
 *          A10 register of the MMAU returning a 64-bit fractional A10 register
 *          value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_mac_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACD | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMACD | MMAU__X3)) = lval;
    return *((frac64_t volatile *)(MMAU__QMACD | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 64-bit fractional value with 32-bit fractional
 *          value and add product with value stored in the A10 register of the MMAU
 *          returning saturated 64-bit fractional A10 register value.
 *
 * @details The @ref MMAU_d_macs_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value and add product with value stored in the
 *          A10 register of the MMAU returning saturated 64-bit fractional A10
 *          register value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_macs_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACD | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMACD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac64_t volatile *)(MMAU__QMACD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit fractional value by value stored in the A10 register
 *          of the MMAU and add product with 64-bit fractional value returning
 *          a 64-bit fractional A10 register value.
 *
 * @details The @ref MMAU_d_maca_dl function multiplies 32-bit fractional value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit fractional value returning a 64-bit fractional A10 register
 *          value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_maca_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACDA | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMACDA | MMAU__X3)) = lval;
    return *((frac64_t volatile *)(MMAU__QMACDA | MMAU__A10));
}

/*!
 * @brief   Saturating multiply 32-bit fractional value by value stored in the
 *          A10 register of the MMAU and add product with 64-bit fractional value returning
 *          a saturated 64-bit fractional A10 register value.
 *
 * @details The @ref MMAU_d_macas_dl function multiplies 32-bit fractional value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit fractional value returning saturated 64-bit fractional A10
 *          register value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac64_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_macas_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACDA | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMACDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac64_t volatile *)(MMAU__QMACDA | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Multiply two 32-bit fractional values and add product with value
 *          stored in the A10 register of the MMAU returning a 32-bit fractional
 *          A10 register value.
 *
 * @details The @ref MMAU_l_mac_ll function multiplies two 32-bit fractional values
 *          and add product with value stored in the A10 register of the MMAU
 *          returning a 32-bit fractional A1 register value.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_mac_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X2)) = lval1;
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X3)) = lval2;
    return *((frac32_t volatile *)(MMAU__QMAC | MMAU__A1));
}

/*!
 * @brief   Saturating multiply two 32-bit fractional values and add product
 *          with value stored in the A10 register of the MMAU returning a 32-bit
 *          fractional A10 register value.
 *
 * @details The @ref MMAU_l_macs_ll function multiplies two 32-bit fractional values
 *          and add product with value stored in the A10 register of the MMAU
 *          returning saturated 32-bit fractional A1 register value.
 * @param   lval1   @ref frac32_t fractional value.
 * @param   lval2   @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_macs_ll(register frac32_t lval1, register frac32_t lval2)
{
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X2 | MMAU__SAT)) = lval1;
    *((frac32_t volatile *)(MMAU__QMAC | MMAU__X3 | MMAU__SAT)) = lval2;
    return *((frac32_t volatile *)(MMAU__QMAC | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Multiply 64-bit fractional value with 32-bit fractional value and
 *          add product with value stored in the A10 register of the MMAU
 *          returning a 32-bit fractional A10 register value.
 *
 * @details The @ref MMAU_l_mac_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value and add product with value stored in the A10
 *          register of the MMAU returning a 32-bit fractional A1 register
 *          value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_mac_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACD | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMACD | MMAU__X3)) = lval;
    return *((frac32_t volatile *)(MMAU__QMACD | MMAU__A1));
}

/*!
 * @brief   Saturating multiply 64-bit fractional value with 32-bit fractional
 *          value and add product with value stored in the A10 register of the
 *          MMAU returning saturated 32-bit fractional A10 register value.
 *
 * @details The @ref MMAU_l_macs_dl function multiplies 64-bit fractional value with
 *          32-bit fractional value and add product with value stored in the A10
 *          register of the MMAU returning saturated 32-bit fractional A1
 *          register value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_macs_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACD | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMACD | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac32_t volatile *)(MMAU__QMACD | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Multiply 32-bit fractional value by value stored in the A10 register
 *          of the MMAU and add product with 64-bit fractional value returning a
 *          32-bit fractional A10 register value.
 *
 * @details The @ref MMAU_l_maca_dl function multiplies 32-bit fractional value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit fractional value returning a 32-bit fractional A1 register
 *          value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Product is stored in A10 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_maca_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACDA | MMAU__X1)) = dval;
    *((frac32_t volatile *)(MMAU__QMACDA | MMAU__X3)) = lval;
    return *((frac32_t volatile *)(MMAU__QMACDA | MMAU__A1));
}

/*!
 * @brief   Saturating multiply 32-bit fractional value by value stored in the
 *          A10 register of the MMAU and add product with 64-bit fractional
 *          value returning a saturated 32-bit fractional A10 register value.
 *
 * @details The @ref MMAU_l_macas_dl function multiplies 32-bit fractional value by
 *          value stored in the A10 register of the MMAU and add product with
 *          64-bit fractional value returning saturated 32-bit fractional A1
 *          register value.
 * @param   dval    @ref frac64_t fractional value.
 * @param   lval    @ref frac32_t fractional value.
 * @return  @ref frac32_t fractional value after multiply.
 * @note    Saturated product is stored in A10 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_macas_dl(register frac64_t dval, register frac32_t lval)
{
    *((frac64_t volatile *)(MMAU__QMACDA | MMAU__X1 | MMAU__SAT)) = dval;
    *((frac32_t volatile *)(MMAU__QMACDA | MMAU__X3 | MMAU__SAT)) = lval;
    return *((frac32_t volatile *)(MMAU__QMACDA | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Divide two 32-bit fractional values returning a 32-bit fractional
 *          quotient.
 *
 * @details The @ref MMAU_l_div_ll function divides two 32-bit fractional values
 *          returning a 32-bit fractional quotient.
 * @param   lnum    @ref frac32_t fractional divisor value.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac32_t fractional quotient value.
 * @note    Quotient is stored in A1 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_div_ll(register frac32_t lnum, register frac32_t lden)
{
    *((frac32_t volatile *)(MMAU__QDIV | MMAU__X2)) = lnum;
    *((frac32_t volatile *)(MMAU__QDIV | MMAU__X3)) = lden;
    return *((frac32_t volatile *)(MMAU__QDIV | MMAU__A1));
}

/*!
 * @brief   Divide two 32-bit fractional values returning a 32-bit fractional
 *          quotient.
 *
 * @details The @ref MMAU_l_divs_ll function divides two 32-bit fractional values
 *          returning a 32-bit fractional quotient.
 * @param   lnum    @ref frac32_t fractional divisor value.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac32_t fractional quotient value.
 * @note    Saturated quotient is  stored in A1 register of the MMAU for
 *          next computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac32_t MMAU_l_divs_ll(register frac32_t lnum, register frac32_t lden)
{
    *((frac32_t volatile *)(MMAU__QDIV | MMAU__X2 | MMAU__SAT)) = lnum;
    *((frac32_t volatile *)(MMAU__QDIV | MMAU__X3 | MMAU__SAT)) = lden;
    return *((frac32_t volatile *)(MMAU__QDIV | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Divide 64-bit fractional value stored in the A10 register of the
 *          MMAU by 32-bit fractional value returning saturated 32-bit
 *          fractional quotient.
 *
 * @details The @ref MMAU_l_divas_l function divides 64-bit fractional value stored
 *          in the A10 register of the MMAU by 32-bit fractional value returning
 *          a saturated 32-bit fractional quotient.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac32_t fractional quotient value.
 * @note    Saturated quotient is stored in A1 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_divas_l(register frac32_t lden)
{
    *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__X3 | MMAU__SAT)) = lden;
    return *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__A1 | MMAU__SAT));
}

/*!
 * @brief   Divide 64-bit fractional value by 32-bit fractional value returning
 *          a 64-bit fractional quotient.
 *
 * @details The @ref MMAU_d_div_dl function divides 64-bit fractional value by 32-bit
 *          fractional value returning a 64-bit fractional quotient.
 * @param   dnum    @ref frac64_t fractional divisor value.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac64_t fractional quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_div_dl(register frac64_t dnum, register frac32_t lden)
{
    *((frac64_t volatile *)(MMAU__QDIVD | MMAU__X1)) = dnum;
    *((frac32_t volatile *)(MMAU__QDIVD | MMAU__X3)) = lden;
    return *((frac64_t volatile *)(MMAU__QDIVD | MMAU__A10));
}

/*!
 * @brief   Divide 64-bit fractional value by 32-bit fractional value returning
 *          a 64-bit fractional quotient.
 *
 * @details The @ref MMAU_d_divs_dl function divides 64-bit fractional value by
 *          32-bit fractional value returning a 64-bit fractional quotient.
 * @param   dnum    @ref frac64_t fractional divisor value.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac64_t fractional quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_divs_dl(register frac64_t dnum, register frac32_t lden)
{
    *((frac64_t volatile *)(MMAU__QDIVD | MMAU__X1 | MMAU__SAT)) = dnum;
    *((frac32_t volatile *)(MMAU__QDIVD | MMAU__X3 | MMAU__SAT)) = lden;
    return *((frac64_t volatile *)(MMAU__QDIVD | MMAU__A10 | MMAU__SAT));
}

/*!
 * @brief   Divide 32-bit fractional value stored in the A10 register of the
 *          MMAU by 32-bit fractional value returning a 64-bit fractional quotient.
 *
 * @details The @ref MMAU_d_diva_l function divides 32-bit fractional value stored in
 *          the A10 register of the MMAU by 32-bit fractional value returning
 *          a 64-bit fractional quotient.
 * @param   lden1   @ref frac32_t fractional dividend value.
 * @return  @ref frac64_t fractional quotient value.
 * @note    Quotient is stored in A10 register of the MMAU for next computation.
 */
static inline frac64_t MMAU_d_diva_l(register frac32_t lden1)
{
    *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__X3)) = lden1;
    return *((frac64_t volatile *)(MMAU__QDIVDA | MMAU__A10));
}

