Masmiseim36/nxpSDK/devices/MKM34Z7/drivers/fsl_mmau.h
/*!
 * @brief   Divide 32-bit fractional value stored in the A10 register of the
 *          MMAU by 32-bit fractional value returning saturated 64-bit fractional quotient.
 *
 * @details The @ref MMAU_d_divas_l function divides 32-bit fractional value stored
 *          in the A10 register of the MMAU by 32-bit fractional value returning
 *          a saturated 64-bit fractional quotient.
 * @param   lden1   @ref frac32_t fractional dividend value.
 * @return  @ref frac64_t fractional quotient value.
 * @note    Saturated quotient is  stored in A10 register of the MMAU for
 *          next computation. If saturation occurs, the instruction sets the
 *          accumulation overflow (Q) and multiply or divide overflow (V) flags
 *          to 1 in the CSR. Otherwise, it clears the Q and V flags.
 */
static inline frac64_t MMAU_d_divas_l(register frac32_t lden1)
{
    *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__X3 | MMAU__SAT)) = lden1;
    return *((frac64_t volatile *)(MMAU__QDIVDA | MMAU__A0 | MMAU__SAT));
}

/*!
 * @brief   Divide 64-bit fractional value stored in the A10 register of the
 *          MMAU by 32-bit fractional value returning a 32-bit fractional
 *          quotient.
 *
 * @details The @ref MMAU_l_diva_l function divides 64-bit fractional value stored in
 *          the A10 register of the MMAU by 32-bit fractional value returning a
 *          32-bit fractional quotient.
 * @param   lden    @ref frac32_t fractional dividend value.
 * @return  @ref frac32_t fractional quotient value.
 * @note    Quotient is stored in A1 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_diva_l(register frac32_t lden)
{
    *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__X3)) = lden;
    return *((frac32_t volatile *)(MMAU__QDIVDA | MMAU__A1));
}

/*!
 * @brief   Compute and return a 32-bit fractional square root of the 32-bit
 *          fractional radicand.
 *
 * @details The @ref MMAU_l_sqr_l function computes and returns a 32-bit fractional
 *          square root of the 32-bit fractional radicand.
 * @param   lrad    @ref frac32_t fractional radicand.
 * @return  @ref frac32_t fractional square root.
 * @note    Square root is stored in A1 register of the MMAU for next
 *          computation.
 */
static inline frac32_t MMAU_l_sqr_l(register frac32_t lrad)
{
    *((frac32_t volatile *)(MMAU__QSQRD | MMAU__X2)) = 0l;
    *((frac32_t volatile *)(MMAU__QSQRD | MMAU__X3)) = lrad;
    return *((frac32_t volatile *)(MMAU__QSQRD | MMAU__A1));
}

/*!
 * @brief   Compute and return a 32-bit fractional square root of the 64-bit
 *          fractional radicand.
 *
 * @details The @ref MMAU_l_sqr_d function computes and returns a 32-bit fractional
 *          square root of the 64-bit fractional radicand.
 * @param   drad    @ref frac64_t fractional radicand.
 * @return  @ref frac32_t fractional square root.
 * @note    Quotient is stored in A1 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_sqr_d(register frac64_t drad)
{
    *((frac64_t volatile *)(MMAU__QSQRD | MMAU__X2)) = drad;
    return *((frac32_t volatile *)(MMAU__QSQRD | MMAU__A1));
}

/*!
 * @brief   Compute and return a 32-bit fractional square root of the radicand
 *          stored in the A10 register of the MMAU.
 *
 * @details The @ref MMAU_l_sqra function computes and returns a 32-bit fractional
 *          square root of the radicand stored in the A10 register of the MMAU.
 * @return  @ref frac32_t fractional square root.
 * @note    Quotient is stored in A1 register of the MMAU for next computation.
 */
static inline frac32_t MMAU_l_sqra(void)
{
    return *((frac32_t volatile *)(MMAU__QSQRDA | MMAU__A1));
}
/*! @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_MMAU_H_ */
